### Week 4: Applied Machine Learning

In [22]:
def f(x):
    '''
    This function takes in an argument x and returns x**2
    
    Arguments
    ---------
    x = numpy array type
    
    Returns
    -------
    array of x **2
    '''
    return x**2

In [23]:
f?

Signature: f(x)
Docstring:
This function takes in an argument x and returns x**2

Arguments
---------
x = numpy array type

Returns
-------
array of x **2
File:      ~/Desktop/now/emeritus/sept_ml/<ipython-input-22-cbfbce3240f2>
Type:      function

In [10]:
f(4)

16

In [13]:
[f(i) for i in range(-2, 2)]

[4, 1, 0, 1]

In [12]:
import numpy as np
X = np.array([1, 2, 3, 4])

In [14]:
f(X)

array([ 1,  4,  9, 16])

In [15]:
nums = np.random.random(size = 100)

In [20]:
data = {'x': nums,
        'f(x)': f(nums)}

In [27]:
nouns = ['steve', 'dog', 'bottle']

def is_noun(x):
    
    if x in nouns:
        return 'yeah, its a noun'
    else:
        return 'maybe it is, maybe it isnt'

In [28]:
is_noun('dog')

'yeah, its a noun'

In [29]:
nouns

['steve', 'dog', 'bottle']

### Nested Functions

In [37]:
def f(x):
    def g(x):
        return x**2
    return g(x)**2

In [38]:
y = f(2)

In [40]:
f(3)

81

### Reading in a `.csv` file

In [57]:
!pwd

/Users/jacobkoehler/Desktop/now/emeritus/sept_ml

In [42]:
with open('data/census.csv') as f:
    data = f.read()

In [44]:
import pandas as pd

In [48]:
data = pd.read_csv('data/census.csv', skiprows = 3)

In [ ]:
data

In [49]:
type(data)

pandas.core.frame.DataFrame

In [63]:
#peek at top rows
data.head()

,Unnamed: 0,Unnamed: 1,Census,Estimates Base,2010,2011,2012,2013,2014,2015,2016,2017,2018,2019
0,1,"New York city, New York","8,175,133","8,175,031","8,190,209","8,272,948","8,346,693","8,396,091","8,433,806","8,463,049","8,469,153","8,437,478","8,390,081","8,336,817"
1,2,"Los Angeles city, California","3,792,621","3,793,139","3,795,512","3,820,876","3,851,202","3,881,622","3,909,901","3,938,568","3,963,226","3,975,788","3,977,596","3,979,576"
2,3,"Chicago city, Illinois","2,695,598","2,695,652","2,697,477","2,708,114","2,719,141","2,725,731","2,727,066","2,724,344","2,716,723","2,711,069","2,701,423","2,693,976"
3,4,"Houston city, Texas","2,099,451","2,095,517","2,100,280","2,126,032","2,161,593","2,199,391","2,241,826","2,286,908","2,309,544","2,316,750","2,318,573","2,320,268"
4,5,"Phoenix city, Arizona","1,445,632","1,446,691","1,449,038","1,469,796","1,499,274","1,526,491","1,555,445","1,583,690","1,612,199","1,633,560","1,654,675","1,680,992"

In [60]:
#extract rows 0 - 5, and columns 0 - 5

In [61]:
#refer to rows and columns by index
data.iloc[:5, :5]

,Unnamed: 0,Unnamed: 1,Census,Estimates Base,2010
0,1,"New York city, New York","8,175,133","8,175,031","8,190,209"
1,2,"Los Angeles city, California","3,792,621","3,793,139","3,795,512"
2,3,"Chicago city, Illinois","2,695,598","2,695,652","2,697,477"
3,4,"Houston city, Texas","2,099,451","2,095,517","2,100,280"
4,5,"Phoenix city, Arizona","1,445,632","1,446,691","1,449,038"

In [62]:
#refer to rows and columns by names
data.loc[:5, ['Census', 'Estimates Base']]

      Census Estimates Base
0  8,175,133      8,175,031
1  3,792,621      3,793,139
2  2,695,598      2,695,652
3  2,099,451      2,095,517
4  1,445,632      1,446,691
5  1,526,006      1,526,012

In [52]:
data.describe()

,Unnamed: 0,Unnamed: 1,Census,Estimates Base,2010,2011,2012,2013,2014,2015,2016,2017,2018,2019
count,793,788,788,788,788,788,788,788,788,788,788,788,788,788
unique,790,788,776,786,785,785,783,785,783,786,787,784,785,785
top,519,"Erie city, Pennsylvania",(X),"49,043","97,849","73,789","57,255","52,786","154,376","60,908","60,304","55,336","65,495","59,439"
freq,2,1,8,2,2,2,2,2,2,2,2,2,2,2

In [58]:
data['Census']

0      8,175,133
1      3,792,621
2      2,695,598
3      2,099,451
4      1,445,632
         ...
788          NaN
789          NaN
790          NaN
791          NaN
792          NaN
Name: Census, Length: 793, dtype: object

In [67]:
#select multiple columns 
#data[['Census', '2010']]
data.loc[:, ['Census', '2010']]

        Census       2010
0    8,175,133  8,190,209
1    3,792,621  3,795,512
2    2,695,598  2,697,477
3    2,099,451  2,100,280
4    1,445,632  1,449,038
..         ...        ...
788        NaN        NaN
789        NaN        NaN
790        NaN        NaN
791        NaN        NaN
792        NaN        NaN

[793 rows x 2 columns]

In [53]:
def avg(x):
    global average
    average = sum(x)/len(x)
    return average

In [54]:
nums = [3, 2, 5, 9]

In [55]:
avg(nums)

4.75

In [56]:
average

4.75